import numpy as np


class Mask:
    '''
    盤面にかけるマスクであり、掛けることで複数のマスクをかけられる
    '''
    '''
    六角形にするマスク
    '''
    hexagon = np.array(
        [[0, 0, 0, 1, 1, 1, 0, 0, 0],
         [0, 1, 1, 1, 1, 1, 1, 1, 0],
         [1, 1, 1, 1, 1, 1, 1, 1, 1],
         [1, 1, 1, 1, 1, 1, 1, 1, 1],
         [1, 1, 1, 1, 1, 1, 1, 1, 1],
         [1, 1, 1, 1, 1, 1, 1, 1, 1],
         [1, 1, 1, 1, 1, 1, 1, 1, 1],
         [0, 0, 1, 1, 1, 1, 1, 0, 0],
         [0, 0, 0, 0, 1, 0, 0, 0, 0],
         ]
    )

    '''
    ランダムに穴をあけるマスク
    '''
    random=np.where(np.random.rand(9,9)<=0.92,1,0)

    def __init__(self):
        pass
